/*
 * @Author: 70Qiang strongcoderman@gmail.com
 * @Date: 2023-11-15 15:55:08
 * @LastEditors: 70Qiang strongcoderman@gmail.com
 * @LastEditTime: 2023-11-15 17:21:28
 * @FilePath: /AwesomeProject/SRC_10_ScrollView/index.js
 * @Description: 这是默认设置,请设置`customMade`, 打开koroFileHeader查看配置 进行设置: https://github.com/OBKoro1/koro1FileHeader/wiki/%E9%85%8D%E7%BD%AE
 */
import React, { Component } from 'react'
import { Text, StyleSheet, View, ScrollView, SafeAreaView, Platform } from 'react-native'

export default class index extends Component {
  render() {
    return (
        // 安全区域view 会自动避开iOS的刘海屏相关的
        <SafeAreaView>


        <ScrollView 
        style={{backgroundColor:"yellow"}}
        horizontal={true}
        >
        <Text style={[styles.nav]}>新闻</Text>
        <Text style={[styles.nav]}>娱乐</Text>
        <Text style={[styles.nav]}>科技</Text>
        <Text style={[styles.nav]}>人文</Text>
        <Text style={[styles.nav]}>动画</Text>
        <Text style={[styles.nav]}>市场</Text>
        <Text style={[styles.nav]}>好玩</Text>
        </ScrollView>

      <ScrollView
      style={[styles.scrollView]}
      contentContainerStyle={{margin:30}}
      >
        <Text> 【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日【100张】美到不想换的风景系列全面屏壁纸 - 知乎
2022年3月28日 【100张】美到不想换的风景系列全面屏壁纸 1 年前 换头像bo ​关注 优质头像/壁纸/背景图请关注公众号:换头像bo 这次更新100张风景系列的全面屏壁纸,都是我精挑细选出来的! 花草树...
知乎
国内10大世界级美景,​光看图片就已心动不已,此生必去才无...
2022年2月13日 布达拉宫是世界上海拔最高,也是西藏最庞大,最完整的古代宫堡建筑群,是第五套人民币50元,纸币背面的风景图案,主要景观由宫殿、壁画、灵塔组成。 布达拉宫主要,由红宫和白宫组成,中间...
知乎
风景照图片大全-风景照高清图片下载-觅知网
6天前 自然风景金色向日葵在田野中被落日的光芒照得发亮风景图 绿色唯美自然阳光投射湖泊风景图片 唯美森林一张风景照片自然风景烟图岩和湖附近的场景吸引在北卡罗莱纳州蓝岭山脉 田野的春天绿色春...
觅知网
风景图片大全-唯美风景图片-风景图片素材-腾牛个性网
好的风景会让人的心情愉悦,风景图片会让你幻身在其中的风景中,体会风景的魅力,风景图片频道提供了唯美的风景图片素材,欢迎挑选.
腾牛网 </Text>

        {/* 解决ScrollView 在安卓下面滚动不到底的问题   根据Platform 来判断OSleix  很常见的问题 */}
        <View style={{height:Platform.OS === 'ios' ? 80: 30}}></View>
        
    </ScrollView>

      </SafeAreaView>
    )
  }
}

const styles = StyleSheet.create({
    scrollView:{
        backgroundColor:'green',
        marginHorizontal:0,
    },
    nav:{
        margin:10,
        height:44,
        fontSize:20,
    }

})
